/* 1. Створіть масив з рядків "travel", "hello", "eat", "ski", "lift" та обчисліть кількість рядків з довжиною більше за 3 символи. Вивести це число в консоль.
 */

let arr = ["travel", "hello", "eat", "ski", "lift"];

let result = 0;
arr.forEach((item) => {
  if (item.length > 3) {
    result++;
  }
});

console.log(result);




/* 2. Створіть масив із 4 об'єктів, які містять інформацію про людей: {name: "Іван", age: 25, sex: "чоловіча"}. Наповніть різними даними. Відфільтруйте його, щоб отримати тільки об'єкти зі sex "чоловіча".

Відфільтрований масив виведіть в консоль.*/


let array = [
  {
    name: "Іван",
    age: 25,
    sex: "чоловіча",
  },
  {
    name: "Дмитро",
    age: 35,
    sex: "чоловіча",
  },
  {
    name: "Тетяна",
    age: 28,
    sex: "жіноча",
  },
  {
    name: "Оксана",
    age: 30,
    sex: "жіноча",
  },
];

let array2 = array.filter((male) => male.sex === "чоловіча");
console.log(array2);

  
/* 3. Реалізувати функцію фільтру масиву за вказаним типом даних. (Опціональне завдання)


Технічні вимоги:


- Написати функцію filterBy(), яка прийматиме 2 аргументи. Перший аргумент - масив, який міститиме будь-які дані, другий аргумент - тип даних.

- Функція повинна повернути новий масив, який міститиме всі дані, які були передані в аргумент, за винятком тих, тип яких був переданий другим аргументом. Тобто якщо передати масив ['hello', 'world', 23, '23', null], і другим аргументом передати 'string', то функція поверне масив [23, null].*/


const arrayOld = ["hello", "world", 23, "23", null];

function filterBy(arrValue, dataType) {
  return arrValue.filter((item) => typeof item !== dataType);
}

const arrayNew = filterBy(arrayOld, "string");
console.log(arrayOld);
console.log(arrayNew);

